from django.utils.translation import gettext_lazy as _

LOG_PATTERNS = {
    "attack": {
        "simple": _("<a href=\"#\">%s</a> провів атаку по <a href=\"#\">%s</a> завдавши %d шкоди."),

        "shooter": _("<a href=\"#\">%s</a> збільшивши відстань між ворогом "
                     "<a href=\"#\">%s</a> робить декілька пострілів лишивши"
                     " поранення у вигляді %d шкоди."),

        "agility": _("<a href=\"#\">%s</a> ухиляючись від атаки наносить по "
                     "<a href=\"#\">%s</a> колюче поранення в розмірі %d шкоди.")
    },
    "defence": {
        "simple": _("<a href=\"#\">%s</a> заблокував атаку <a href=\"#\">%s</a>."),
        "shooter": _("<a href=\"#\">%s</a> відчувши атаку ворога"
                     " <a href=\"#\">%s</a> було заблоковано атаку."),
        "agility": _("<a href=\"#\">%s</a> відчувши атаку ворога"
                     " <a href=\"#\">%s</a> було заблоковано атаку.")
    },
    "effect": {
        "bliding": _("<a href=\"#\">%s</a> дуже прудким і ріжучим ударом у"
                     " <a href=\"#\">%s</a> сталася сильна кровотеча."),
        "bones": _("<a href=\"#\">%s</a> сильним ударом ноги у"
                   " <a href=\"#\">%s</a> було накладено ефект перелому.")
    }
}

INSTRUCTION_LOGS = {
    0: {
        "head": _("Історія"),
        "desc": _(
            "Колись давно було собі невеличке місто Гроссенберг, "
            "який мав славу через своє велике підземелля, в якому видобувалися різні "
            "корисні копалини починаючи з вугілля й закінчуючи сапфірами й діамантами. "
            "Але в один день прийшла армія загарбників й захопила славетне підземелля."),
        "img": None
    },
    1: {
        "head": _("Привітання!"),
        "desc": _(
            "Ласкаво проси вас до гри \"Бійцівський клуб\". "
            "Тут на вас чекають: цікаві пригоди в підземеллі й нескінченні "
            "бої з іншими гравцями"
            " й боссами підземель. Ваша роль звільнити підземелля від ворогів й стати його захистником "
            "до кінця своїх днів."),
        "img": None
    },
    2: {
        "head": _("Орієнтування по мапі"),
        "desc": _(
            "У грі є дві основні локації це:<br/> "
            "Центр міста – тут ви зможете дістатися локації церкви, щоб зняти негативні ефекти, "
            "зайти до магазину де зможете згідно свого рівня купити знаряддя.<br/> "
            "Окраїна міста – найбільш популярна локація через яку можна дістатися до підземілля й "
            "також увійти в таверну щоб помірятися силою з іншими гравцями."),
        "img": "map.png"
    },
    3: {
        "head": _("Покращення навичок"),
        "desc": _(
            "З кожним підвищеним рівнем персонажу дається "
            "по 3 вільних очків розподілу рівня атрибутів персонажу, "
            "тому не забувайте розподіляти вільні очки покращення персонажу."),
        "img": "abilities.png"
    },
    4: {
        "head": _("Купівля предметів"),
        "desc": _(
            "У магазині ви матимете різні предмети для персонажів різного класу. "
            "В залежності від цього якщо ви ловкач ви зможете купити й одягти меч силача,"
            " тільки щоб зробити це вам потрібно буде покращувати атрибут сили, бо кожен предмет"
            " має мінімальний рівень кожного з атрибутів персонажу."),
        "img": "shop.png"
    },
    5: {
        "head": _("Таверна"),
        "desc": _(
            "Таверна мабуть найцікавіша локація, "
            "де гравці зможуть створювати й приєднуватися до інших"
            " бойових кімнат за для перевірки своєї сили між іншими гравцями. Також ваша"),
        "img": None
    },
    6: {
        "head": _("Підземілля"),
        "desc": _("Підземілля – це головне місце для набивання грошей"
                  " і проходження квестів з таверни."),
        "img": "dungeon.png"
    },
    7: {
        "head": _("Бої"),
        "desc": _(
            "Основна механіка бою після обирання місця оборони й атаки натиснути на кнопку "
            "\"Уперед!\". Після чого в логах можна буде побачити результат вашого ходу."),
        "img": "fight.png"
    }
}


def get_text_effect(who: str, whom: str, type_l: str) -> str:
    log_pattern = LOG_PATTERNS.get("effect", {}).get(type_l, "")
    return log_pattern % (who, whom)


def get_text_attack(who: str, whom: str, type_l: str, **kwargs) -> str:
    log_pattern = LOG_PATTERNS.get("attack", {}).get(type_l, "")
    return log_pattern % (who, whom, kwargs['dmg'])


def get_text_defence(who: str, whom: str, type_l: str) -> str:
    log_pattern = LOG_PATTERNS.get("defence", {}).get(type_l, "")
    return log_pattern % (whom, who)


def select_log(who: str, whom: str, dmg: int, attack_type: str = "simple") -> callable:
    if dmg > 0:
        return get_text_attack(who, whom, attack_type, dmg=dmg)
    return get_text_defence(who, whom, attack_type)
